program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.1.2"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp16, [1, 1, 512, 288]> last_mask, tensor<fp16, [1, 1, 1, 16, 257]> obj_memory, tensor<fp16, [1, 256, 32, 18]> pix_feat, tensor<fp16, [1, 1, 256, 32, 18]> pixel, tensor<fp16, [1, 1, 256, 32, 18]> sensory) {
            tensor<int32, [2]> last_mask_3_kernel_sizes_0 = const()[name = string("last_mask_3_kernel_sizes_0"), val = tensor<int32, [2]>([16, 16])];
            tensor<int32, [2]> last_mask_3_strides_0 = const()[name = string("last_mask_3_strides_0"), val = tensor<int32, [2]>([16, 16])];
            string last_mask_3_pad_type_0 = const()[name = string("last_mask_3_pad_type_0"), val = string("valid")];
            tensor<int32, [4]> last_mask_3_pad_0 = const()[name = string("last_mask_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            bool last_mask_3_ceil_mode_0 = const()[name = string("last_mask_3_ceil_mode_0"), val = bool(false)];
            bool last_mask_3_exclude_padding_from_average_0 = const()[name = string("last_mask_3_exclude_padding_from_average_0"), val = bool(false)];
            tensor<fp16, [1, 1, 32, 18]> last_mask_3_cast_fp16 = avg_pool(ceil_mode = last_mask_3_ceil_mode_0, exclude_padding_from_average = last_mask_3_exclude_padding_from_average_0, kernel_sizes = last_mask_3_kernel_sizes_0, pad = last_mask_3_pad_0, pad_type = last_mask_3_pad_type_0, strides = last_mask_3_strides_0, x = last_mask)[name = string("last_mask_3_cast_fp16")];
            int32 var_27 = const()[name = string("op_27"), val = int32(2)];
            int32 var_28 = const()[name = string("op_28"), val = int32(1)];
            tensor<int32, [1]> last_mask_axes_0 = const()[name = string("last_mask_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1, 1, 32, 18]> last_mask_cast_fp16 = expand_dims(axes = last_mask_axes_0, x = last_mask_3_cast_fp16)[name = string("last_mask_cast_fp16")];
            bool g_1_interleave_0 = const()[name = string("g_1_interleave_0"), val = bool(false)];
            tensor<fp16, [1, 1, 257, 32, 18]> g_1_cast_fp16 = concat(axis = var_27, interleave = g_1_interleave_0, values = (sensory, last_mask_cast_fp16))[name = string("g_1_cast_fp16")];
            tensor<int32, [4]> concat_0 = const()[name = string("concat_0"), val = tensor<int32, [4]>([1, 257, 32, 18])];
            tensor<fp16, [1, 257, 32, 18]> input_1_cast_fp16 = reshape(shape = concat_0, x = g_1_cast_fp16)[name = string("input_1_cast_fp16")];
            string g_3_pad_type_0 = const()[name = string("g_3_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> g_3_strides_0 = const()[name = string("g_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> g_3_pad_0 = const()[name = string("g_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> g_3_dilations_0 = const()[name = string("g_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 g_3_groups_0 = const()[name = string("g_3_groups_0"), val = int32(1)];
            tensor<fp16, [256, 257, 1, 1]> m_pixel_fuser_sensory_compress_weight_to_fp16 = const()[name = string("m_pixel_fuser_sensory_compress_weight_to_fp16"), val = tensor<fp16, [256, 257, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(64)))];
            tensor<fp16, [256]> m_pixel_fuser_sensory_compress_bias_to_fp16 = const()[name = string("m_pixel_fuser_sensory_compress_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(131712)))];
            tensor<fp16, [1, 256, 32, 18]> g_3_cast_fp16 = conv(bias = m_pixel_fuser_sensory_compress_bias_to_fp16, dilations = g_3_dilations_0, groups = g_3_groups_0, pad = g_3_pad_0, pad_type = g_3_pad_type_0, strides = g_3_strides_0, weight = m_pixel_fuser_sensory_compress_weight_to_fp16, x = input_1_cast_fp16)[name = string("g_3_cast_fp16")];
            tensor<int32, [5]> var_59 = const()[name = string("op_59"), val = tensor<int32, [5]>([1, 1, 256, 32, 18])];
            tensor<fp16, [1, 1, 256, 32, 18]> sensory_readout_cast_fp16 = reshape(shape = var_59, x = g_3_cast_fp16)[name = string("sensory_readout_cast_fp16")];
            tensor<fp16, [1, 1, 256, 32, 18]> g_5_cast_fp16 = add(x = pixel, y = sensory_readout_cast_fp16)[name = string("g_5_cast_fp16")];
            string x_1_pad_type_0 = const()[name = string("x_1_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> x_1_strides_0 = const()[name = string("x_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> x_1_pad_0 = const()[name = string("x_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_1_dilations_0 = const()[name = string("x_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 x_1_groups_0 = const()[name = string("x_1_groups_0"), val = int32(1)];
            tensor<fp16, [256, 256, 1, 1]> m_pixel_fuser_fuser_distributor_x_transform_weight_to_fp16 = const()[name = string("m_pixel_fuser_fuser_distributor_x_transform_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(132288)))];
            tensor<fp16, [256]> m_pixel_fuser_fuser_distributor_x_transform_bias_to_fp16 = const()[name = string("m_pixel_fuser_fuser_distributor_x_transform_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(263424)))];
            tensor<fp16, [1, 256, 32, 18]> x_1_cast_fp16 = conv(bias = m_pixel_fuser_fuser_distributor_x_transform_bias_to_fp16, dilations = x_1_dilations_0, groups = x_1_groups_0, pad = x_1_pad_0, pad_type = x_1_pad_type_0, strides = x_1_strides_0, weight = m_pixel_fuser_fuser_distributor_x_transform_weight_to_fp16, x = pix_feat)[name = string("x_1_cast_fp16")];
            tensor<int32, [4]> concat_1 = const()[name = string("concat_1"), val = tensor<int32, [4]>([1, 256, 32, 18])];
            tensor<fp16, [1, 256, 32, 18]> input_3_cast_fp16 = reshape(shape = concat_1, x = g_5_cast_fp16)[name = string("input_3_cast_fp16")];
            string g_7_pad_type_0 = const()[name = string("g_7_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> g_7_strides_0 = const()[name = string("g_7_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> g_7_pad_0 = const()[name = string("g_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> g_7_dilations_0 = const()[name = string("g_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 g_7_groups_0 = const()[name = string("g_7_groups_0"), val = int32(1)];
            tensor<fp16, [256, 256, 1, 1]> m_pixel_fuser_fuser_distributor_g_transform_weight_to_fp16 = const()[name = string("m_pixel_fuser_fuser_distributor_g_transform_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(264000)))];
            tensor<fp16, [256]> m_pixel_fuser_fuser_distributor_g_transform_bias_to_fp16 = const()[name = string("m_pixel_fuser_fuser_distributor_g_transform_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(395136)))];
            tensor<fp16, [1, 256, 32, 18]> g_7_cast_fp16 = conv(bias = m_pixel_fuser_fuser_distributor_g_transform_bias_to_fp16, dilations = g_7_dilations_0, groups = g_7_groups_0, pad = g_7_pad_0, pad_type = g_7_pad_type_0, strides = g_7_strides_0, weight = m_pixel_fuser_fuser_distributor_g_transform_weight_to_fp16, x = input_3_cast_fp16)[name = string("g_7_cast_fp16")];
            tensor<int32, [5]> var_95 = const()[name = string("op_95"), val = tensor<int32, [5]>([1, 1, 256, 32, 18])];
            tensor<fp16, [1, 1, 256, 32, 18]> g_9_cast_fp16 = reshape(shape = var_95, x = g_7_cast_fp16)[name = string("g_9_cast_fp16")];
            tensor<int32, [1]> var_97_axes_0 = const()[name = string("op_97_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 256, 32, 18]> var_97_cast_fp16 = expand_dims(axes = var_97_axes_0, x = x_1_cast_fp16)[name = string("op_97_cast_fp16")];
            tensor<fp16, [1, 1, 256, 32, 18]> g_11_cast_fp16 = add(x = var_97_cast_fp16, y = g_9_cast_fp16)[name = string("g_11_cast_fp16")];
            tensor<int32, [4]> concat_3 = const()[name = string("concat_3"), val = tensor<int32, [4]>([1, 256, 32, 18])];
            tensor<fp16, [1, 256, 32, 18]> input_5_cast_fp16 = reshape(shape = concat_3, x = g_11_cast_fp16)[name = string("input_5_cast_fp16")];
            tensor<fp16, [1, 256, 32, 18]> input_7_cast_fp16 = relu(x = input_5_cast_fp16)[name = string("input_7_cast_fp16")];
            string input_9_pad_type_0 = const()[name = string("input_9_pad_type_0"), val = string("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = string("input_9_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_9_strides_0 = const()[name = string("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = string("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 input_9_groups_0 = const()[name = string("input_9_groups_0"), val = int32(1)];
            tensor<fp16, [256, 256, 3, 3]> m_pixel_fuser_fuser_block1_conv1_weight_to_fp16 = const()[name = string("m_pixel_fuser_fuser_block1_conv1_weight_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(395712)))];
            tensor<fp16, [256]> m_pixel_fuser_fuser_block1_conv1_bias_to_fp16 = const()[name = string("m_pixel_fuser_fuser_block1_conv1_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1575424)))];
            tensor<fp16, [1, 256, 32, 18]> input_9_cast_fp16 = conv(bias = m_pixel_fuser_fuser_block1_conv1_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = m_pixel_fuser_fuser_block1_conv1_weight_to_fp16, x = input_7_cast_fp16)[name = string("input_9_cast_fp16")];
            tensor<fp16, [1, 256, 32, 18]> input_11_cast_fp16 = relu(x = input_9_cast_fp16)[name = string("input_11_cast_fp16")];
            string x_5_pad_type_0 = const()[name = string("x_5_pad_type_0"), val = string("custom")];
            tensor<int32, [4]> x_5_pad_0 = const()[name = string("x_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x_5_strides_0 = const()[name = string("x_5_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x_5_dilations_0 = const()[name = string("x_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 x_5_groups_0 = const()[name = string("x_5_groups_0"), val = int32(1)];
            tensor<fp16, [256, 256, 3, 3]> m_pixel_fuser_fuser_block1_conv2_weight_to_fp16 = const()[name = string("m_pixel_fuser_fuser_block1_conv2_weight_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(1576000)))];
            tensor<fp16, [256]> m_pixel_fuser_fuser_block1_conv2_bias_to_fp16 = const()[name = string("m_pixel_fuser_fuser_block1_conv2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2755712)))];
            tensor<fp16, [1, 256, 32, 18]> x_5_cast_fp16 = conv(bias = m_pixel_fuser_fuser_block1_conv2_bias_to_fp16, dilations = x_5_dilations_0, groups = x_5_groups_0, pad = x_5_pad_0, pad_type = x_5_pad_type_0, strides = x_5_strides_0, weight = m_pixel_fuser_fuser_block1_conv2_weight_to_fp16, x = input_11_cast_fp16)[name = string("x_5_cast_fp16")];
            tensor<int32, [2]> w_1_axes_0 = const()[name = string("w_1_axes_0"), val = tensor<int32, [2]>([-2, -1])];
            bool w_1_keep_dims_0 = const()[name = string("w_1_keep_dims_0"), val = bool(true)];
            tensor<fp16, [1, 256, 1, 1]> w_1_cast_fp16 = reduce_mean(axes = w_1_axes_0, keep_dims = w_1_keep_dims_0, x = x_5_cast_fp16)[name = string("w_1_cast_fp16")];
            tensor<int32, [4]> var_126 = const()[name = string("op_126"), val = tensor<int32, [4]>([1, 1, 256, 1])];
            tensor<fp16, [1, 1, 256, 1]> w_3_cast_fp16 = reshape(shape = var_126, x = w_1_cast_fp16)[name = string("w_3_cast_fp16")];
            string w_5_pad_type_0 = const()[name = string("w_5_pad_type_0"), val = string("custom")];
            tensor<int32, [4]> w_5_pad_0 = const()[name = string("w_5_pad_0"), val = tensor<int32, [4]>([2, 2, 0, 0])];
            tensor<int32, [2]> w_5_strides_0 = const()[name = string("w_5_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> w_5_dilations_0 = const()[name = string("w_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 w_5_groups_0 = const()[name = string("w_5_groups_0"), val = int32(1)];
            tensor<fp16, [1, 1, 5, 1]> k2_1_to_fp16 = const()[name = string("k2_1_to_fp16"), val = tensor<fp16, [1, 1, 5, 1]>([[[[0x1.cb4p-5], [-0x1.f38p-2], [-0x1.fe8p-2], [-0x1.5fp-1], [-0x1.cf4p-5]]]])];
            tensor<fp16, [1, 1, 256, 1]> w_5_cast_fp16 = conv(dilations = w_5_dilations_0, groups = w_5_groups_0, pad = w_5_pad_0, pad_type = w_5_pad_type_0, strides = w_5_strides_0, weight = k2_1_to_fp16, x = w_3_cast_fp16)[name = string("w_5_cast_fp16")];
            tensor<int32, [4]> var_134 = const()[name = string("op_134"), val = tensor<int32, [4]>([1, 256, 1, 1])];
            tensor<fp16, [1, 256, 1, 1]> var_135_cast_fp16 = reshape(shape = var_134, x = w_5_cast_fp16)[name = string("op_135_cast_fp16")];
            tensor<fp16, [1, 256, 1, 1]> w_7_cast_fp16 = sigmoid(x = var_135_cast_fp16)[name = string("w_7_cast_fp16")];
            tensor<fp16, [1, 256, 32, 18]> var_137_cast_fp16 = mul(x = x_5_cast_fp16, y = w_7_cast_fp16)[name = string("op_137_cast_fp16")];
            tensor<fp16, [1, 256, 32, 18]> input_13_cast_fp16 = add(x = var_137_cast_fp16, y = input_5_cast_fp16)[name = string("input_13_cast_fp16")];
            tensor<fp16, [1, 256, 32, 18]> input_15_cast_fp16 = relu(x = input_13_cast_fp16)[name = string("input_15_cast_fp16")];
            string input_17_pad_type_0 = const()[name = string("input_17_pad_type_0"), val = string("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = string("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_17_strides_0 = const()[name = string("input_17_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_17_dilations_0 = const()[name = string("input_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 input_17_groups_0 = const()[name = string("input_17_groups_0"), val = int32(1)];
            tensor<fp16, [256, 256, 3, 3]> m_pixel_fuser_fuser_block2_conv1_weight_to_fp16 = const()[name = string("m_pixel_fuser_fuser_block2_conv1_weight_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2756288)))];
            tensor<fp16, [256]> m_pixel_fuser_fuser_block2_conv1_bias_to_fp16 = const()[name = string("m_pixel_fuser_fuser_block2_conv1_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(3936000)))];
            tensor<fp16, [1, 256, 32, 18]> input_17_cast_fp16 = conv(bias = m_pixel_fuser_fuser_block2_conv1_bias_to_fp16, dilations = input_17_dilations_0, groups = input_17_groups_0, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = input_17_strides_0, weight = m_pixel_fuser_fuser_block2_conv1_weight_to_fp16, x = input_15_cast_fp16)[name = string("input_17_cast_fp16")];
            tensor<fp16, [1, 256, 32, 18]> input_19_cast_fp16 = relu(x = input_17_cast_fp16)[name = string("input_19_cast_fp16")];
            string x_7_pad_type_0 = const()[name = string("x_7_pad_type_0"), val = string("custom")];
            tensor<int32, [4]> x_7_pad_0 = const()[name = string("x_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> x_7_strides_0 = const()[name = string("x_7_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> x_7_dilations_0 = const()[name = string("x_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 x_7_groups_0 = const()[name = string("x_7_groups_0"), val = int32(1)];
            tensor<fp16, [256, 256, 3, 3]> m_pixel_fuser_fuser_block2_conv2_weight_to_fp16 = const()[name = string("m_pixel_fuser_fuser_block2_conv2_weight_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(3936576)))];
            tensor<fp16, [256]> m_pixel_fuser_fuser_block2_conv2_bias_to_fp16 = const()[name = string("m_pixel_fuser_fuser_block2_conv2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5116288)))];
            tensor<fp16, [1, 256, 32, 18]> x_7_cast_fp16 = conv(bias = m_pixel_fuser_fuser_block2_conv2_bias_to_fp16, dilations = x_7_dilations_0, groups = x_7_groups_0, pad = x_7_pad_0, pad_type = x_7_pad_type_0, strides = x_7_strides_0, weight = m_pixel_fuser_fuser_block2_conv2_weight_to_fp16, x = input_19_cast_fp16)[name = string("x_7_cast_fp16")];
            tensor<int32, [2]> w_9_axes_0 = const()[name = string("w_9_axes_0"), val = tensor<int32, [2]>([-2, -1])];
            bool w_9_keep_dims_0 = const()[name = string("w_9_keep_dims_0"), val = bool(true)];
            tensor<fp16, [1, 256, 1, 1]> w_9_cast_fp16 = reduce_mean(axes = w_9_axes_0, keep_dims = w_9_keep_dims_0, x = x_7_cast_fp16)[name = string("w_9_cast_fp16")];
            tensor<int32, [4]> var_163 = const()[name = string("op_163"), val = tensor<int32, [4]>([1, 1, 256, 1])];
            tensor<fp16, [1, 1, 256, 1]> w_11_cast_fp16 = reshape(shape = var_163, x = w_9_cast_fp16)[name = string("w_11_cast_fp16")];
            string w_13_pad_type_0 = const()[name = string("w_13_pad_type_0"), val = string("custom")];
            tensor<int32, [4]> w_13_pad_0 = const()[name = string("w_13_pad_0"), val = tensor<int32, [4]>([2, 2, 0, 0])];
            tensor<int32, [2]> w_13_strides_0 = const()[name = string("w_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> w_13_dilations_0 = const()[name = string("w_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 w_13_groups_0 = const()[name = string("w_13_groups_0"), val = int32(1)];
            tensor<fp16, [1, 1, 5, 1]> k2_3_to_fp16 = const()[name = string("k2_3_to_fp16"), val = tensor<fp16, [1, 1, 5, 1]>([[[[-0x1.8p-2], [-0x1.a3cp-2], [-0x1.0d4p-3], [-0x1.2ep-2], [-0x1.2ep-5]]]])];
            tensor<fp16, [1, 1, 256, 1]> w_13_cast_fp16 = conv(dilations = w_13_dilations_0, groups = w_13_groups_0, pad = w_13_pad_0, pad_type = w_13_pad_type_0, strides = w_13_strides_0, weight = k2_3_to_fp16, x = w_11_cast_fp16)[name = string("w_13_cast_fp16")];
            tensor<int32, [4]> var_171 = const()[name = string("op_171"), val = tensor<int32, [4]>([1, 256, 1, 1])];
            tensor<fp16, [1, 256, 1, 1]> var_172_cast_fp16 = reshape(shape = var_171, x = w_13_cast_fp16)[name = string("op_172_cast_fp16")];
            tensor<fp16, [1, 256, 1, 1]> w_15_cast_fp16 = sigmoid(x = var_172_cast_fp16)[name = string("w_15_cast_fp16")];
            tensor<fp16, [1, 256, 32, 18]> var_174_cast_fp16 = mul(x = x_7_cast_fp16, y = w_15_cast_fp16)[name = string("op_174_cast_fp16")];
            tensor<fp16, [1, 256, 32, 18]> g_13_cast_fp16 = add(x = var_174_cast_fp16, y = input_13_cast_fp16)[name = string("g_13_cast_fp16")];
            tensor<int32, [5]> var_179 = const()[name = string("op_179"), val = tensor<int32, [5]>([1, 1, 256, 32, 18])];
            tensor<fp16, [1, 1, 256, 32, 18]> p16_cast_fp16 = reshape(shape = var_179, x = g_13_cast_fp16)[name = string("p16_cast_fp16")];
            bool pixel_interleave_0 = const()[name = string("pixel_interleave_0"), val = bool(false)];
            tensor<fp16, [1, 1, 256, 32, 18]> pixel_cast_fp16 = concat(axis = var_28, interleave = pixel_interleave_0, values = p16_cast_fp16)[name = string("pixel_cast_fp16")];
            int32 var_201 = const()[name = string("op_201"), val = int32(-1)];
            int32 var_209 = const()[name = string("op_209"), val = int32(1)];
            tensor<int32, [4]> var_240 = const()[name = string("op_240"), val = tensor<int32, [4]>([1, 1, 16, 257])];
            tensor<fp16, [1, 1, 16, 257]> obj_summaries_cast_fp16 = reshape(shape = var_240, x = obj_memory)[name = string("obj_summaries_cast_fp16")];
            tensor<int32, [4]> var_245_begin_0 = const()[name = string("op_245_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_245_end_0 = const()[name = string("op_245_end_0"), val = tensor<int32, [4]>([1, 1, 16, 256])];
            tensor<bool, [4]> var_245_end_mask_0 = const()[name = string("op_245_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 1, 16, 256]> var_245_cast_fp16 = slice_by_index(begin = var_245_begin_0, end = var_245_end_0, end_mask = var_245_end_mask_0, x = obj_summaries_cast_fp16)[name = string("op_245_cast_fp16")];
            tensor<int32, [1]> obj_sums_axes_0 = const()[name = string("obj_sums_axes_0"), val = tensor<int32, [1]>([1])];
            bool obj_sums_keep_dims_0 = const()[name = string("obj_sums_keep_dims_0"), val = bool(false)];
            tensor<fp16, [1, 16, 256]> obj_sums_cast_fp16 = reduce_sum(axes = obj_sums_axes_0, keep_dims = obj_sums_keep_dims_0, x = var_245_cast_fp16)[name = string("obj_sums_cast_fp16")];
            tensor<int32, [4]> var_251_begin_0 = const()[name = string("op_251_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 256])];
            tensor<int32, [4]> var_251_end_0 = const()[name = string("op_251_end_0"), val = tensor<int32, [4]>([1, 1, 16, 1])];
            tensor<bool, [4]> var_251_end_mask_0 = const()[name = string("op_251_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 1, 16, 1]> var_251_cast_fp16 = slice_by_index(begin = var_251_begin_0, end = var_251_end_0, end_mask = var_251_end_mask_0, x = obj_summaries_cast_fp16)[name = string("op_251_cast_fp16")];
            tensor<int32, [1]> obj_area_axes_0 = const()[name = string("obj_area_axes_0"), val = tensor<int32, [1]>([1])];
            bool obj_area_keep_dims_0 = const()[name = string("obj_area_keep_dims_0"), val = bool(false)];
            tensor<fp16, [1, 16, 1]> obj_area_cast_fp16 = reduce_sum(axes = obj_area_axes_0, keep_dims = obj_area_keep_dims_0, x = var_251_cast_fp16)[name = string("obj_area_cast_fp16")];
            fp16 var_254_to_fp16 = const()[name = string("op_254_to_fp16"), val = fp16(0x1.a38p-14)];
            tensor<fp16, [1, 16, 1]> var_255_cast_fp16 = add(x = obj_area_cast_fp16, y = var_254_to_fp16)[name = string("op_255_cast_fp16")];
            tensor<fp16, [1, 16, 256]> input_21_cast_fp16 = real_div(x = obj_sums_cast_fp16, y = var_255_cast_fp16)[name = string("input_21_cast_fp16")];
            tensor<fp16, [256, 256]> m_object_transformer_summary_to_query_init_weight_to_fp16 = const()[name = string("m_object_transformer_summary_to_query_init_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5116864)))];
            tensor<fp16, [256]> m_object_transformer_summary_to_query_init_bias_to_fp16 = const()[name = string("m_object_transformer_summary_to_query_init_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5248000)))];
            tensor<fp16, [1, 16, 256]> linear_0_cast_fp16 = linear(bias = m_object_transformer_summary_to_query_init_bias_to_fp16, weight = m_object_transformer_summary_to_query_init_weight_to_fp16, x = input_21_cast_fp16)[name = string("linear_0_cast_fp16")];
            tensor<fp16, [256, 256]> m_object_transformer_summary_to_query_emb_weight_to_fp16 = const()[name = string("m_object_transformer_summary_to_query_emb_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5248576)))];
            tensor<fp16, [256]> m_object_transformer_summary_to_query_emb_bias_to_fp16 = const()[name = string("m_object_transformer_summary_to_query_emb_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5379712)))];
            tensor<fp16, [1, 16, 256]> linear_1_cast_fp16 = linear(bias = m_object_transformer_summary_to_query_emb_bias_to_fp16, weight = m_object_transformer_summary_to_query_emb_weight_to_fp16, x = input_21_cast_fp16)[name = string("linear_1_cast_fp16")];
            tensor<fp16, [1, 16, 256]> var_263_to_fp16 = const()[name = string("op_263_to_fp16"), val = tensor<fp16, [1, 16, 256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5380288)))];
            tensor<fp16, [1, 16, 256]> input_31_cast_fp16 = add(x = var_263_to_fp16, y = linear_0_cast_fp16)[name = string("input_31_cast_fp16")];
            tensor<fp16, [1, 16, 256]> var_269_to_fp16 = const()[name = string("op_269_to_fp16"), val = tensor<fp16, [1, 16, 256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5388544)))];
            tensor<fp16, [1, 16, 256]> x_pe_cast_fp16 = add(x = var_269_to_fp16, y = linear_1_cast_fp16)[name = string("x_pe_cast_fp16")];
            tensor<int32, [4]> concat_6 = const()[name = string("concat_6"), val = tensor<int32, [4]>([1, 256, 32, 18])];
            tensor<fp16, [1, 256, 32, 18]> input_23_cast_fp16 = reshape(shape = concat_6, x = pixel_cast_fp16)[name = string("input_23_cast_fp16")];
            string g_15_pad_type_0 = const()[name = string("g_15_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> g_15_strides_0 = const()[name = string("g_15_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> g_15_pad_0 = const()[name = string("g_15_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> g_15_dilations_0 = const()[name = string("g_15_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 g_15_groups_0 = const()[name = string("g_15_groups_0"), val = int32(1)];
            tensor<fp16, [256, 256, 1, 1]> m_object_transformer_pixel_init_proj_weight_to_fp16 = const()[name = string("m_object_transformer_pixel_init_proj_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5396800)))];
            tensor<fp16, [256]> m_object_transformer_pixel_init_proj_bias_to_fp16 = const()[name = string("m_object_transformer_pixel_init_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5527936)))];
            tensor<fp16, [1, 256, 32, 18]> g_15_cast_fp16 = conv(bias = m_object_transformer_pixel_init_proj_bias_to_fp16, dilations = g_15_dilations_0, groups = g_15_groups_0, pad = g_15_pad_0, pad_type = g_15_pad_type_0, strides = g_15_strides_0, weight = m_object_transformer_pixel_init_proj_weight_to_fp16, x = input_23_cast_fp16)[name = string("g_15_cast_fp16")];
            tensor<int32, [5]> var_288 = const()[name = string("op_288"), val = tensor<int32, [5]>([1, 1, 256, 32, 18])];
            tensor<fp16, [1, 1, 256, 32, 18]> input_27_cast_fp16 = reshape(shape = var_288, x = g_15_cast_fp16)[name = string("input_27_cast_fp16")];
            string g_17_pad_type_0 = const()[name = string("g_17_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> g_17_strides_0 = const()[name = string("g_17_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> g_17_pad_0 = const()[name = string("g_17_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> g_17_dilations_0 = const()[name = string("g_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 g_17_groups_0 = const()[name = string("g_17_groups_0"), val = int32(1)];
            tensor<fp16, [256, 256, 1, 1]> m_object_transformer_pixel_emb_proj_weight_to_fp16 = const()[name = string("m_object_transformer_pixel_emb_proj_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5528512)))];
            tensor<fp16, [256]> m_object_transformer_pixel_emb_proj_bias_to_fp16 = const()[name = string("m_object_transformer_pixel_emb_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5659648)))];
            tensor<fp16, [1, 256, 32, 18]> g_17_cast_fp16 = conv(bias = m_object_transformer_pixel_emb_proj_bias_to_fp16, dilations = g_17_dilations_0, groups = g_17_groups_0, pad = g_17_pad_0, pad_type = g_17_pad_type_0, strides = g_17_strides_0, weight = m_object_transformer_pixel_emb_proj_weight_to_fp16, x = input_23_cast_fp16)[name = string("g_17_cast_fp16")];
            tensor<int32, [3]> concat_32 = const()[name = string("concat_32"), val = tensor<int32, [3]>([1, 256, 576])];
            tensor<fp16, [1, 256, 576]> var_361_cast_fp16 = reshape(shape = concat_32, x = g_17_cast_fp16)[name = string("op_361_cast_fp16")];
            tensor<int32, [3]> var_362_perm_0 = const()[name = string("op_362_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1, 576, 256]> var_364_to_fp16 = const()[name = string("op_364_to_fp16"), val = tensor<fp16, [1, 576, 256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5660224)))];
            tensor<fp16, [1, 576, 256]> var_362_cast_fp16 = transpose(perm = var_362_perm_0, x = var_361_cast_fp16)[name = string("transpose_91")];
            tensor<fp16, [1, 576, 256]> mem_pe_cast_fp16 = add(x = var_364_to_fp16, y = var_362_cast_fp16)[name = string("mem_pe_cast_fp16")];
            tensor<fp16, [1, 1, 256, 32, 18]> g_19_cast_fp16 = relu(x = input_27_cast_fp16)[name = string("g_19_cast_fp16")];
            tensor<int32, [4]> concat_34 = const()[name = string("concat_34"), val = tensor<int32, [4]>([1, 256, 32, 18])];
            tensor<fp16, [1, 256, 32, 18]> input_29_cast_fp16 = reshape(shape = concat_34, x = g_19_cast_fp16)[name = string("input_29_cast_fp16")];
            string g_21_pad_type_0 = const()[name = string("g_21_pad_type_0"), val = string("valid")];
            tensor<int32, [2]> g_21_strides_0 = const()[name = string("g_21_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> g_21_pad_0 = const()[name = string("g_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> g_21_dilations_0 = const()[name = string("g_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            int32 g_21_groups_0 = const()[name = string("g_21_groups_0"), val = int32(1)];
            tensor<fp16, [1, 256, 1, 1]> m_object_transformer_mask_pred_0_1_weight_to_fp16 = const()[name = string("m_object_transformer_mask_pred_0_1_weight_to_fp16"), val = tensor<fp16, [1, 256, 1, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5955200)))];
            tensor<fp16, [1]> m_object_transformer_mask_pred_0_1_bias_to_fp16 = const()[name = string("m_object_transformer_mask_pred_0_1_bias_to_fp16"), val = tensor<fp16, [1]>([0x1p-22])];
            tensor<fp16, [1, 1, 32, 18]> g_21_cast_fp16 = conv(bias = m_object_transformer_mask_pred_0_1_bias_to_fp16, dilations = g_21_dilations_0, groups = g_21_groups_0, pad = g_21_pad_0, pad_type = g_21_pad_type_0, strides = g_21_strides_0, weight = m_object_transformer_mask_pred_0_1_weight_to_fp16, x = input_29_cast_fp16)[name = string("g_21_cast_fp16")];
            tensor<int32, [5]> var_381 = const()[name = string("op_381"), val = tensor<int32, [5]>([1, 1, 1, 32, 18])];
            tensor<fp16, [1, 1, 1, 32, 18]> var_382_cast_fp16 = reshape(shape = var_381, x = g_21_cast_fp16)[name = string("op_382_cast_fp16")];
            tensor<int32, [1]> logits_1_axes_0 = const()[name = string("logits_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1, 32, 18]> logits_1_cast_fp16 = squeeze(axes = logits_1_axes_0, x = var_382_cast_fp16)[name = string("logits_1_cast_fp16")];
            tensor<fp16, [1, 1, 32, 18]> prob_1_cast_fp16 = sigmoid(x = logits_1_cast_fp16)[name = string("prob_1_cast_fp16")];
            fp16 var_209_promoted_to_fp16 = const()[name = string("op_209_promoted_to_fp16"), val = fp16(0x1p+0)];
            tensor<fp16, [1, 1, 32, 18]> var_386_cast_fp16 = sub(x = var_209_promoted_to_fp16, y = prob_1_cast_fp16)[name = string("op_386_cast_fp16")];
            tensor<int32, [1]> var_387_axes_0 = const()[name = string("op_387_axes_0"), val = tensor<int32, [1]>([1])];
            bool var_387_keep_dims_0 = const()[name = string("op_387_keep_dims_0"), val = bool(true)];
            tensor<fp16, [1, 1, 32, 18]> var_387_cast_fp16 = reduce_prod(axes = var_387_axes_0, keep_dims = var_387_keep_dims_0, x = var_386_cast_fp16)[name = string("op_387_cast_fp16")];
            bool var_389_interleave_0 = const()[name = string("op_389_interleave_0"), val = bool(false)];
            tensor<fp16, [1, 2, 32, 18]> var_389_cast_fp16 = concat(axis = var_209, interleave = var_389_interleave_0, values = (var_387_cast_fp16, prob_1_cast_fp16))[name = string("op_389_cast_fp16")];
            fp16 var_191_to_fp16 = const()[name = string("op_191_to_fp16"), val = fp16(0x1p-23)];
            fp16 var_190_to_fp16 = const()[name = string("op_190_to_fp16"), val = fp16(0x1p+0)];
            tensor<fp16, [1, 2, 32, 18]> clip_0_cast_fp16 = clip(alpha = var_191_to_fp16, beta = var_190_to_fp16, x = var_389_cast_fp16)[name = string("clip_0_cast_fp16")];
            fp16 var_209_promoted_1_to_fp16 = const()[name = string("op_209_promoted_1_to_fp16"), val = fp16(0x1p+0)];
            tensor<fp16, [1, 2, 32, 18]> var_391_cast_fp16 = sub(x = var_209_promoted_1_to_fp16, y = clip_0_cast_fp16)[name = string("op_391_cast_fp16")];
            tensor<fp16, [1, 2, 32, 18]> var_392_cast_fp16 = real_div(x = clip_0_cast_fp16, y = var_391_cast_fp16)[name = string("op_392_cast_fp16")];
            fp32 logits_3_epsilon_0 = const()[name = string("logits_3_epsilon_0"), val = fp32(0x1p-149)];
            tensor<fp16, [1, 2, 32, 18]> logits_3_cast_fp16 = log(epsilon = logits_3_epsilon_0, x = var_392_cast_fp16)[name = string("logits_3_cast_fp16")];
            tensor<int32, [4]> var_395_begin_0 = const()[name = string("op_395_begin_0"), val = tensor<int32, [4]>([0, 1, 0, 0])];
            tensor<int32, [4]> var_395_end_0 = const()[name = string("op_395_end_0"), val = tensor<int32, [4]>([1, 2, 32, 18])];
            tensor<bool, [4]> var_395_end_mask_0 = const()[name = string("op_395_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<fp16, [1, 1, 32, 18]> var_395_cast_fp16 = slice_by_index(begin = var_395_begin_0, end = var_395_end_0, end_mask = var_395_end_mask_0, x = logits_3_cast_fp16)[name = string("op_395_cast_fp16")];
            tensor<int32, [1]> reduce_max_0_axes_0 = const()[name = string("reduce_max_0_axes_0"), val = tensor<int32, [1]>([1])];
            bool reduce_max_0_keep_dims_0 = const()[name = string("reduce_max_0_keep_dims_0"), val = bool(true)];
            tensor<fp16, [1, 1, 32, 18]> reduce_max_0_cast_fp16 = reduce_max(axes = reduce_max_0_axes_0, keep_dims = reduce_max_0_keep_dims_0, x = logits_3_cast_fp16)[name = string("reduce_max_0_cast_fp16")];
            tensor<bool, [1, 1, 32, 18]> is_foreground_1_cast_fp16 = greater_equal(x = var_395_cast_fp16, y = reduce_max_0_cast_fp16)[name = string("is_foreground_1_cast_fp16")];
            tensor<int32, [3]> concat_35 = const()[name = string("concat_35"), val = tensor<int32, [3]>([1, 1, 576])];
            tensor<bool, [1, 1, 576]> foreground_mask_1 = reshape(shape = concat_35, x = is_foreground_1_cast_fp16)[name = string("foreground_mask_1")];
            tensor<bool, [1, 1, 576]> inv_foreground_mask_1 = logical_not(x = foreground_mask_1)[name = string("inv_foreground_mask_1")];
            tensor<int32, [1]> var_402_axes_0 = const()[name = string("op_402_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<bool, [1, 1, 1, 576]> var_402 = expand_dims(axes = var_402_axes_0, x = inv_foreground_mask_1)[name = string("op_402")];
            tensor<int32, [1]> var_403_axes_0 = const()[name = string("op_403_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<bool, [1, 1, 1, 1, 576]> var_403 = expand_dims(axes = var_403_axes_0, x = var_402)[name = string("op_403")];
            tensor<int32, [5]> var_404 = const()[name = string("op_404"), val = tensor<int32, [5]>([1, 1, 8, 8, 1])];
            tensor<bool, [1, 1, 8, 8, 576]> var_405 = tile(reps = var_404, x = var_403)[name = string("op_405")];
            tensor<int32, [3]> concat_36 = const()[name = string("concat_36"), val = tensor<int32, [3]>([8, 8, 576])];
            tensor<bool, [8, 8, 576]> aux_foreground_mask_1 = reshape(shape = concat_36, x = var_405)[name = string("aux_foreground_mask_1")];
            tensor<int32, [1]> var_407_axes_0 = const()[name = string("op_407_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<bool, [1, 1, 1, 576]> var_407 = expand_dims(axes = var_407_axes_0, x = foreground_mask_1)[name = string("op_407")];
            tensor<int32, [1]> var_408_axes_0 = const()[name = string("op_408_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<bool, [1, 1, 1, 1, 576]> var_408 = expand_dims(axes = var_408_axes_0, x = var_407)[name = string("op_408")];
            tensor<int32, [5]> var_409 = const()[name = string("op_409"), val = tensor<int32, [5]>([1, 1, 8, 8, 1])];
            tensor<bool, [1, 1, 8, 8, 576]> var_410 = tile(reps = var_409, x = var_408)[name = string("op_410")];
            tensor<int32, [3]> concat_37 = const()[name = string("concat_37"), val = tensor<int32, [3]>([8, 8, 576])];
            tensor<bool, [8, 8, 576]> aux_background_mask_1 = reshape(shape = concat_37, x = var_410)[name = string("aux_background_mask_1")];
            bool aux_mask_1_interleave_0 = const()[name = string("aux_mask_1_interleave_0"), val = bool(false)];
            tensor<bool, [8, 16, 576]> aux_mask_1 = concat(axis = var_209, interleave = aux_mask_1_interleave_0, values = (aux_foreground_mask_1, aux_background_mask_1))[name = string("aux_mask_1")];
            tensor<int32, [1]> var_415_axes_0 = const()[name = string("op_415_axes_0"), val = tensor<int32, [1]>([-1])];
            bool var_415_keep_dims_0 = const()[name = string("op_415_keep_dims_0"), val = bool(true)];
            string cast_41_to_fp16_dtype_0 = const()[name = string("cast_41_to_fp16_dtype_0"), val = string("fp16")];
            tensor<fp16, [8, 16, 576]> aux_mask_1_to_fp16 = cast(dtype = cast_41_to_fp16_dtype_0, x = aux_mask_1)[name = string("cast_175")];
            tensor<fp16, [8, 16, 1]> var_415_cast_fp16 = reduce_sum(axes = var_415_axes_0, keep_dims = var_415_keep_dims_0, x = aux_mask_1_to_fp16)[name = string("op_415_cast_fp16")];
            tensor<fp16, [1]> var_417_promoted_to_fp16 = const()[name = string("op_417_promoted_to_fp16"), val = tensor<fp16, [1]>([0x1.2p+9])];
            tensor<bool, [8, 16, 1]> all_masked_1_cast_fp16 = equal(x = var_415_cast_fp16, y = var_417_promoted_to_fp16)[name = string("all_masked_1_cast_fp16")];
            tensor<bool, [8, 16, 1]> var_419 = logical_not(x = all_masked_1_cast_fp16)[name = string("op_419")];
            tensor<bool, [8, 16, 576]> mask_1 = logical_and(x = aux_mask_1, y = var_419)[name = string("mask_1")];
            tensor<int32, [3]> concat_39 = const()[name = string("concat_39"), val = tensor<int32, [3]>([1, 256, 576])];
            tensor<fp16, [1, 256, 576]> var_427_cast_fp16 = reshape(shape = concat_39, x = input_27_cast_fp16)[name = string("op_427_cast_fp16")];
            tensor<int32, [3]> var_428_perm_0 = const()[name = string("op_428_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> x_9_axes_0 = const()[name = string("x_9_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> m_object_transformer_blocks_0_read_from_pixel_norm_weight_to_fp16 = const()[name = string("m_object_transformer_blocks_0_read_from_pixel_norm_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5955776)))];
            tensor<fp16, [256]> m_object_transformer_blocks_0_read_from_pixel_norm_bias_to_fp16 = const()[name = string("m_object_transformer_blocks_0_read_from_pixel_norm_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5956352)))];
            fp16 var_187_to_fp16 = const()[name = string("op_187_to_fp16"), val = fp16(0x1.5p-17)];
            tensor<fp16, [1, 16, 256]> x_9_cast_fp16 = layer_norm(axes = x_9_axes_0, beta = m_object_transformer_blocks_0_read_from_pixel_norm_bias_to_fp16, epsilon = var_187_to_fp16, gamma = m_object_transformer_blocks_0_read_from_pixel_norm_weight_to_fp16, x = input_31_cast_fp16)[name = string("x_9_cast_fp16")];
            tensor<fp16, [1, 16, 256]> x_11_cast_fp16 = add(x = x_9_cast_fp16, y = x_pe_cast_fp16)[name = string("x_11_cast_fp16")];
            tensor<fp16, [1, 576, 256]> var_428_cast_fp16 = transpose(perm = var_428_perm_0, x = var_427_cast_fp16)[name = string("transpose_90")];
            tensor<fp16, [1, 576, 256]> x_13_cast_fp16 = add(x = var_428_cast_fp16, y = mem_pe_cast_fp16)[name = string("x_13_cast_fp16")];
            fp16 var_184_to_fp16 = const()[name = string("op_184_to_fp16"), val = fp16(-inf)];
            tensor<fp16, [8, 16, 576]> var_444_to_fp16 = const()[name = string("op_444_to_fp16"), val = tensor<fp16, [8, 16, 576]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(5956928)))];
            tensor<fp16, [8, 16, 576]> attn_mask_1_cast_fp16 = select(a = var_184_to_fp16, b = var_444_to_fp16, cond = mask_1)[name = string("attn_mask_1_cast_fp16")];
            tensor<int32, [3]> query_1_perm_0 = const()[name = string("query_1_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [3]> key_1_perm_0 = const()[name = string("key_1_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [3]> value_1_perm_0 = const()[name = string("value_1_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp16, [256, 256]> var_462_0_to_fp16 = const()[name = string("op_462_0_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6104448)))];
            tensor<fp16, [256]> var_465_0_to_fp16 = const()[name = string("op_465_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6235584)))];
            tensor<fp16, [16, 1, 256]> query_1_cast_fp16 = transpose(perm = query_1_perm_0, x = x_11_cast_fp16)[name = string("transpose_89")];
            tensor<fp16, [16, 1, 256]> linear_2_cast_fp16 = linear(bias = var_465_0_to_fp16, weight = var_462_0_to_fp16, x = query_1_cast_fp16)[name = string("linear_2_cast_fp16")];
            tensor<fp16, [256, 256]> var_462_1_to_fp16 = const()[name = string("op_462_1_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6236160)))];
            tensor<fp16, [256]> var_465_1_to_fp16 = const()[name = string("op_465_1_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6367296)))];
            tensor<fp16, [576, 1, 256]> key_1_cast_fp16 = transpose(perm = key_1_perm_0, x = x_13_cast_fp16)[name = string("transpose_88")];
            tensor<fp16, [576, 1, 256]> linear_3_cast_fp16 = linear(bias = var_465_1_to_fp16, weight = var_462_1_to_fp16, x = key_1_cast_fp16)[name = string("linear_3_cast_fp16")];
            tensor<fp16, [256, 256]> var_462_2_to_fp16 = const()[name = string("op_462_2_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6367872)))];
            tensor<fp16, [256]> var_465_2_to_fp16 = const()[name = string("op_465_2_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(6499008)))];
            tensor<fp16, [576, 1, 256]> value_1_cast_fp16 = transpose(perm = value_1_perm_0, x = var_428_cast_fp16)[name = string("transpose_87")];
            tensor<fp16, [576, 1, 256]> linear_4_cast_fp16 = linear(bias = var_465_2_to_fp16, weight = var_462_2_to_fp16, x = value_1_cast_fp16)[name = string("linear_4_cast_fp16")];
            tensor<int32, [3]> var_474 = const()[name = string("op_474"), val = tensor<int32, [3]>([16, 8, 32])];
            tensor<fp16, [16, 8, 32]> var_475_cast_fp16 = reshape(shape = var_474, x = linear_2_cast_fp16)[name = string("op_475_cast_fp16")];
            tensor<int32, [3]> q_3_perm_0 = const()[name = string("q_3_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [3]> var_481 = const()[name = string("op_481"), val = tensor<int32, [3]>([576, 8, 32])];
            tensor<fp16, [576, 8, 32]> var_482_cast_fp16 = reshape(shape = var_481, x = linear_3_cast_fp16)[name = string("op_482_cast_fp16")];
            tensor<int32, [3]> k_3_perm_0 = const()[name = string("k_3_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [3]> var_488 = const()[name = string("op_488"), val = tensor<int32, [3]>([576, 8, 32])];
            tensor<fp16, [576, 8, 32]> var_489_cast_fp16 = reshape(shape = var_488, x = linear_4_cast_fp16)[name = string("op_489_cast_fp16")];
            tensor<int32, [3]> v_3_perm_0 = const()[name = string("v_3_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [4]> var_492 = const()[name = string("op_492"), val = tensor<int32, [4]>([1, 8, -1, 576])];
            tensor<fp16, [1, 8, 16, 576]> attn_mask_3_cast_fp16 = reshape(shape = var_492, x = attn_mask_1_cast_fp16)[name = string("attn_mask_3_cast_fp16")];
            tensor<int32, [4]> var_494 = const()[name = string("op_494"), val = tensor<int32, [4]>([1, 8, 16, 32])];
            tensor<fp16, [8, 16, 32]> q_3_cast_fp16 = transpose(perm = q_3_perm_0, x = var_475_cast_fp16)[name = string("transpose_86")];
            tensor<fp16, [1, 8, 16, 32]> query_3_cast_fp16 = reshape(shape = var_494, x = q_3_cast_fp16)[name = string("query_3_cast_fp16")];
            tensor<int32, [4]> var_496 = const()[name = string("op_496"), val = tensor<int32, [4]>([1, 8, 576, 32])];
            tensor<fp16, [8, 576, 32]> k_3_cast_fp16 = transpose(perm = k_3_perm_0, x = var_482_cast_fp16)[name = string("transpose_85")];
            tensor<fp16, [1, 8, 576, 32]> key_3_cast_fp16 = reshape(shape = var_496, x = k_3_cast_fp16)[name = string("key_3_cast_fp16")];
            tensor<int32, [4]> var_498 = const()[name = string("op_498"), val = tensor<int32, [4]>([1, 8, 576, 32])];
            tensor<fp16, [8, 576, 32]> v_3_cast_fp16 = transpose(perm = v_3_perm_0, x = var_489_cast_fp16)[name = string("transpose_84")];
            tensor<fp16, [1, 8, 576, 32]> value_3_cast_fp16 = reshape(shape = var_498, x = v_3_cast_fp16)[name = string("value_3_cast_fp16")];
            bool var_501_transpose_x_1 = const()[name = string("op_501_transpose_x_1"), val = bool(false)];
            bool var_501_transpose_y_1 = const()[name = string("op_501_transpose_y_1"), val = bool(true)];
            tensor<fp16, [1, 8, 16, 576]> var_501_cast_fp16 = matmul(transpose_x = var_501_transpose_x_1, transpose_y = var_501_transpose_y_1, x = query_3_cast_fp16, y = key_3_cast_fp16)[name = string("op_501_cast_fp16")];
            fp16 var_502_to_fp16 = const()[name = string("op_502_to_fp16"), val = fp16(0x1.6ap-3)];
            tensor<fp16, [1, 8, 16, 576]> attn_1_cast_fp16 = mul(x = var_501_cast_fp16, y = var_502_to_fp16)[name = string("attn_1_cast_fp16")];
            tensor<fp16, [1, 8, 16, 576]> attn_3_cast_fp16 = add(x = attn_1_cast_fp16, y = attn_mask_3_cast_fp16)[name = string("attn_3_cast_fp16")];
            tensor<fp16, [1, 8, 16, 576]> attn_5_cast_fp16 = softmax(axis = var_201, x = attn_3_cast_fp16)[name = string("attn_5_cast_fp16")];
            bool attn_output_1_transpose_x_0 = const()[name = string("attn_output_1_transpose_x_0"), val = bool(false)];
            bool attn_output_1_transpose_y_0 = const()[name = string("attn_output_1_transpose_y_0"), val = bool(false)];
            tensor<fp16, [1, 8, 16, 32]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = attn_5_cast_fp16, y = value_3_cast_fp16)[name = string("attn_output_1_cast_fp16")];
            tensor<int32, [4]> var_507 = const()[name = string("op_507"), val = tensor<int32, [4]>([2, 0, 1, 3])];
            tensor<int32, [2]> var_512 = const()[name = string("op_512"), val = tensor<int32, [2]>([16, 256])];
            tensor<fp16, [16, 1, 8, 32]> var_508_cast_fp16 = transpose(perm = var_507, x = attn_output_1_cast_fp16)[name = string("transpose_83")];
            tensor<fp16, [16, 256]> attn_output_3_cast_fp16 = reshape(shape = var_512, x = var_508_cast_fp16)[name = string("attn_output_3_cast_fp16")];
